
i = 0
s = 0
while i < 10:
    i += 1
    s += i
    if s > 15:
        break
    i += 1
    print(i)

print(i)

# Відповідь має бути така:
#    цикл в нас проходить від 1 до 9
#    поступово збільшуючи i на одиницю
#    але до s ми додаємо значення i в кожен момент циклу
#    Тобто:
#      1+1 2+2 4+3 7+4 11+5 ツ
#    Неправильно 🤔
#     А, i збільшується двічі, на початку і у КІНЦІ!!!
#       Ну і при виході з циклу воно чомусь записало ще одну одиницю…
#    Тобто відповідь така:
#    0+1 1+3 4+5 9+7 16+9 25+11
